In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv('Hyderabad.csv')
data['price'] = data['price'] / 100000

In [3]:
data.head()

    price  sqft     location  bathrooms  bhk            area_type
0   69.68  1340     Nizampet        2.0    1  Super built-up Area
1  290.00  3498  Hitech City        5.0    3            Plot Area
2   65.90  1318    Manikonda        2.0    3        Built-up Area
3   57.39  1295        Alwal        3.0    2  Super built-up Area
4   56.79  1145   Kukatpally        2.0    4  Super built-up Area

In [4]:
data.shape

(2518, 6)

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2518 entries, 0 to 2517
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   price      2518 non-null   float64
 1   sqft       2518 non-null   int64
 2   location   2518 non-null   object
 3   bathrooms  2500 non-null   float64
 4   bhk        2518 non-null   int64
 5   area_type  2518 non-null   object
dtypes: float64(2), int64(2), object(2)
memory usage: 118.2+ KB

In [6]:
for column in data.columns:
    print(data[column].value_counts())
    print("*"*20)

35.00    48
39.00    46
60.00    45
45.00    43
80.00    39
         ..
52.75     1
40.44     1
27.50     1
75.88     1
49.68     1
Name: price, Length: 690, dtype: int64
********************
1100    76
1150    76
1200    69
1050    67
1515    50
        ..
3015     1
2490     1
980      1
4395     1
2049     1
Name: sqft, Length: 579, dtype: int64
********************
Kukatpally                      166
Kondapur                        149
Manikonda                       115
Nizampet                        106
Gachibowli                       83
                               ...
Arvind Nagar Colony               1
Mansoorabad                       1
Gurramguda                        1
Khizra Enclave                    1
Paramount Colony Toli Chowki      1
Name: location, Length: 243, dtype: int64
********************
2.0     1313
3.0      618
4.0      241
1.0      148
5.0       77
6.0       46
7.0       25
8.0       12
9.0       10
10.0       4
12.0       2
11.0       2
27.0       1
14.0       1
Name: bathrooms, dtype: int64
********************
3     995
2     722
4     439
1     255
5      56
6      24
7       9
8       8
9       7
10      2
11      1
Name: bhk, dtype: int64
********************
Super built-up Area    1648
Built-up Area           474
Plot Area               377
Carpet Area              19
Name: area_type, dtype: int64
********************

In [7]:
data.isna().sum()

price         0
sqft          0
location      0
bathrooms    18
bhk           0
area_type     0
dtype: int64

In [8]:
data.describe()

             price         sqft    bathrooms          bhk
count  2518.000000  2518.000000  2500.000000  2518.000000
mean     98.183796  1644.571088     2.696400     2.813741
std      87.771129   746.256956     1.397501     1.143576
min      20.000000   500.000000     1.000000     1.000000
25%      47.600000  1160.000000     2.000000     2.000000
50%      77.540000  1500.000000     2.000000     3.000000
75%     109.000000  1829.000000     3.000000     3.000000
max    1650.000000  9400.000000    27.000000    11.000000

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2518 entries, 0 to 2517
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   price      2518 non-null   float64
 1   sqft       2518 non-null   int64
 2   location   2518 non-null   object
 3   bathrooms  2500 non-null   float64
 4   bhk        2518 non-null   int64
 5   area_type  2518 non-null   object
dtypes: float64(2), int64(2), object(2)
memory usage: 118.2+ KB

In [10]:
data['location'].value_counts()

Kukatpally                      166
Kondapur                        149
Manikonda                       115
Nizampet                        106
Gachibowli                       83
                               ...
Arvind Nagar Colony               1
Mansoorabad                       1
Gurramguda                        1
Khizra Enclave                    1
Paramount Colony Toli Chowki      1
Name: location, Length: 243, dtype: int64

In [11]:
data['location'] = data['location'].fillna('Kukatpally')

In [12]:
data['bhk'].value_counts()

3     995
2     722
4     439
1     255
5      56
6      24
7       9
8       8
9       7
10      2
11      1
Name: bhk, dtype: int64

In [13]:
data['bhk'] = data['bhk'].fillna('2')

In [14]:
data['bathrooms'] = data['bathrooms'].fillna(data['bathrooms'].median())

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2518 entries, 0 to 2517
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   price      2518 non-null   float64
 1   sqft       2518 non-null   int64
 2   location   2518 non-null   object
 3   bathrooms  2518 non-null   float64
 4   bhk        2518 non-null   int64
 5   area_type  2518 non-null   object
dtypes: float64(2), int64(2), object(2)
memory usage: 118.2+ KB

In [16]:
data[data.bhk > 20]

Empty DataFrame
Columns: [price, sqft, location, bathrooms, bhk, area_type]
Index: []

In [17]:
data['sqft'].unique()

array([1340, 3498, 1318, 1295, 1145, 1230, 1350, 1400, 2240, 1520, 1535,
       1150, 1285, 1897, 1725, 1665, 1592, 1050, 1735, 2800, 1175, 1190,
       2956,  680, 1970, 1105, 2005, 1406, 1545, 1495, 1300, 1200, 1450,
       1912, 1850, 1674, 1242,  850, 1895, 1636, 1076, 1080, 2100, 1265,
       1089, 1100, 1700, 2150, 1195, 1205, 1250,  950, 1908, 1675, 1420,
        910, 1325, 1717, 2400, 1000, 1040, 1181, 1550, 1280, 1945, 3500,
       2729, 1500, 2165, 1822, 1270, 1600, 1818, 1282, 1830, 1815, 1220,
       1650, 1680, 1555, 1685, 1225, 1795, 1435, 1430, 2080, 2092, 1370,
       2232, 2063, 1865, 2270, 1896, 3031, 1702, 1525, 1728, 1640, 1835,
       1570, 1140, 1530, 1900, 3380, 1875, 2540, 2630, 4500, 2700, 1792,
       1673, 2200, 1170, 1644, 1687, 1554, 1684,  970, 1415, 1980, 1905,
       1925, 1482, 1800, 1730, 1165, 1110, 1278, 1215, 1770, 1210, 1010,
       1620, 1670, 4780, 1836, 2000, 1315, 2500, 3959, 1889, 1920, 1885,
       1695, 1090, 3100, 1521, 2490, 1260,  900, 1710, 1705, 1330, 2250,
        800, 1840, 1560, 3200, 2950, 1699, 1254, 4067, 1320, 1605, 2120,
       1860, 3090, 6718,  842, 3600, 1245, 1418, 1940, 1615, 1160,  908,
       1380,  840,  931, 1740, 3145,  963,  909, 1180,  845, 1460, 1360,
       2460, 1107, 2900, 1745,  684, 1635, 1585, 1385, 1035, 1720, 1327,
        941, 1390,  540,  810, 1985, 1014, 1085, 3000,  955, 1155, 1120,
        966, 1575,  940, 1060, 1015, 1208, 1425, 1130,  930, 1506, 2450,
       2405, 4070, 1490, 1755, 1216, 2070, 3025, 2786, 2050, 1880, 2665,
       2220, 3448, 3015, 2007, 1630, 2600, 2300, 2960, 2350, 1924, 1580,
       1125, 1515, 2848, 1492, 1283, 1410, 1463, 2085, 2580, 2185, 2210,
       1111, 1161, 2021, 9400, 1465, 1228, 1106, 1096, 1765, 1005, 1750,
       1471,  990, 3180,  987, 1075,  600, 1275, 1376, 1972, 1628, 1274,
       1784, 1788, 1966, 1502, 1707, 1642, 1487, 1633, 1877, 1524, 1326,
       1597, 1020, 1935, 1045, 1214, 1368, 2115,  902, 1025, 1480, 1510,
       1523, 3233, 1548, 1294, 1538, 1678, 1361, 1681,  607, 1565,  682,
       1539, 1641, 1402, 1401, 1008, 1188, 1199, 1115, 1568, 1794, 1953,
       3434, 1799, 1638, 1392,  905, 3266, 1652, 3147, 3044, 2051, 3101,
       3049, 1738, 1355, 1334, 1346, 1473, 2607, 2192, 2815, 2452, 2191,
       2813, 1290, 2049, 3494, 1336, 1655, 1313, 1256, 1780, 1785, 1511,
       1610, 1503, 1189, 1209, 1279, 1311, 1405, 1627, 1778, 1971, 1846,
       1804, 1559, 1629, 1752, 1808, 1986, 1715, 1826, 1995, 1996, 5200,
       1990,  550, 1235, 2260, 2015, 4650, 1742, 1505, 2026, 2771, 2595,
       2060, 1255, 2285, 1993, 2282, 1384, 1874, 1820, 4160, 1139,  770,
       1257, 2225, 2170, 2025, 2160, 1395, 1366, 1146, 1441, 1950, 1951,
       1621, 1128,  960, 1470, 1955, 2865, 1201, 2380, 2925, 1003, 5000,
        750, 3300, 1028, 1591, 4320, 1507, 1412, 3350, 1055,  933, 1026,
        982,  700, 4799, 4152, 2166, 2612, 1232, 3230, 1271, 4395, 4146,
       2875, 2744, 2141, 1931, 1782, 4829, 1475, 4700, 4300, 1122, 2020,
       3190, 1775, 1662, 3493, 4800, 1185, 3490, 1834, 2615, 4400, 8500,
       1589, 1604, 2265, 1688, 2625, 2385, 3240, 1240, 2644, 3450, 1960,
        980, 1590, 4375, 3258, 1007, 2664, 1147, 3900, 3765, 2230, 1314,
       3355, 7600, 1513, 1557, 1057, 2122, 1375, 1001, 3085, 3195, 1002,
       1013, 1012, 1691, 3615, 3590, 3875, 4290, 2445,  920, 2750, 1006,
       1206, 1202, 1203, 1104, 4150, 1296,  998,  500, 1103, 1440, 1133,
       1134,  710, 1978, 3537, 1207, 3430, 2655,  861, 3152, 1030, 3550,
       2983, 1625, 4600, 2103, 1760, 3975,  965, 1310, 1269, 1365, 3474,
       3695, 1595, 5440, 2850, 3556, 2566, 1436, 4000, 1331, 2650, 1358,
       2075, 3325,  880,  925, 4730, 1645, 3883, 2008, 4305, 1616, 2690,
       1091, 1540, 1844,  875, 3250, 2175, 2180, 2190, 1551, 2010, 1093,
       3405, 2585, 1197, 1485, 1887,  961, 1805], dtype=int64)

In [18]:
def convertRange(x):
    temp = x.split('-')
    if len(temp) == 2:
        return (float(temp[0]) + float(temp[1]))/2
    try:
        return float(x)
    except:
        return None

In [19]:
data.head()

    price  sqft     location  bathrooms  bhk            area_type
0   69.68  1340     Nizampet        2.0    1  Super built-up Area
1  290.00  3498  Hitech City        5.0    3            Plot Area
2   65.90  1318    Manikonda        2.0    3        Built-up Area
3   57.39  1295        Alwal        3.0    2  Super built-up Area
4   56.79  1145   Kukatpally        2.0    4  Super built-up Area

# Price Per Square Feet

In [20]:
data['location'].value_counts()

Kukatpally                      166
Kondapur                        149
Manikonda                       115
Nizampet                        106
Gachibowli                       83
                               ...
Arvind Nagar Colony               1
Mansoorabad                       1
Gurramguda                        1
Khizra Enclave                    1
Paramount Colony Toli Chowki      1
Name: location, Length: 243, dtype: int64

In [21]:
data['location'] = data['location'].apply(lambda x: x.strip())

In [22]:
data['location']

0          Nizampet
1       Hitech City
2         Manikonda
3             Alwal
4        Kukatpally
           ...
2513       Nacharam
2514      Manikonda
2515       Madhapur
2516    Hitech City
2517       Narsingi
Name: location, Length: 2518, dtype: object

In [23]:
location_count = data['location'].value_counts()

In [24]:
location_count

Kukatpally                      166
Kondapur                        149
Manikonda                       115
Nizampet                        106
Gachibowli                       83
                               ...
Arvind Nagar Colony               1
Mansoorabad                       1
Gurramguda                        1
Khizra Enclave                    1
Paramount Colony Toli Chowki      1
Name: location, Length: 243, dtype: int64

In [25]:
location_count_less_10 = location_count[location_count <= 10]
location_count_less_10

Mehdipatnam                     10
Gandipet                        10
Chaitanyapuri                    9
Habsiguda                        9
Pati                             9
                                ..
Arvind Nagar Colony              1
Mansoorabad                      1
Gurramguda                       1
Khizra Enclave                   1
Paramount Colony Toli Chowki     1
Name: location, Length: 189, dtype: int64

In [26]:
data['location'] = data['location'].apply(lambda x: 'Other' if x in location_count_less_10 else x)

In [27]:
data['location'].value_counts()

Other                        468
Kukatpally                   166
Kondapur                     149
Manikonda                    115
Nizampet                     106
Gachibowli                    83
Hitech City                   82
Miyapur                       80
Kokapet                       79
Pragathi Nagar Kukatpally     57
Bachupally Road               55
Narsingi                      52
Beeramguda                    51
Puppalaguda                   51
Nanakramguda                  49
Gajularamaram                 48
Banjara Hills                 44
Tellapur                      43
Appa Junction                 43
Serilingampally               41
Jubilee Hills                 41
Madhapur                      34
Krishna Reddy Pet             34
Nallagandla Gachibowli        32
Bachupally                    28
Appa Junction Peerancheru     28
Mallampet                     22
Malkajgiri                    22
Begumpet                      21
Aminpur                       20
Alwal                         20
Nacharam                      19
Kollur Road                   19
Balanagar                     18
Sanath Nagar                  18
Mallapur                      18
Attapur                       17
Chandanagar                   17
West Marredpally              17
Kompally                      16
Nagole                        16
Bandlaguda Jagir              15
Patancheru                    15
East Marredpally              14
LB Nagar                      14
Adibatla                      14
Shaikpet                      13
Tarnaka                       13
Toli Chowki                   12
Gajulramaram Kukatpally       12
Nallakunta                    12
Madinaguda                    12
Darga Khaliz Khan             11
TellapurOsman Nagar Road      11
Kachiguda                     11
Name: location, dtype: int64

# Outliers Detection and Removal

In [28]:
(data['sqft'] / data['bhk']).describe()

count    2518.000000
mean      697.642440
std       492.039654
min       117.000000
25%       396.666667
50%       550.000000
75%       825.000000
max      5200.000000
dtype: float64

In [29]:
data = data[((data['sqft']/data['bhk']) >= 300)]
data.describe()

             price         sqft    bathrooms          bhk
count  2336.000000  2336.000000  2336.000000  2336.000000
mean    101.825813  1685.497432     2.685360     2.665668
std      89.869908   755.181996     1.387268     0.950574
min      20.020000   607.000000     1.000000     1.000000
25%      50.000000  1195.000000     2.000000     2.000000
50%      80.000000  1515.000000     2.000000     3.000000
75%     111.000000  1875.000000     3.000000     3.000000
max    1650.000000  9400.000000    27.000000     9.000000

In [30]:
data.shape

(2336, 6)

In [31]:
data.price.describe()

count    2336.000000
mean      101.825813
std        89.869908
min        20.020000
25%        50.000000
50%        80.000000
75%       111.000000
max      1650.000000
Name: price, dtype: float64

In [32]:
def remove_outliers_sqft(df):
    df_output = pd.DataFrame()
    for key,subdf in df.groupby('location'):
        m = np.mean(subdf.price)
        st = np.std(subdf.price)
        gen_df = subdf[(subdf.price > (m-st)) & (subdf.price <= (m+st))]
        df_output = pd.concat([df_output,gen_df],ignore_index =True)
    return df_output
data = remove_outliers_sqft(data)
data.describe()

             price         sqft    bathrooms          bhk
count  1844.000000  1844.000000  1844.000000  1844.000000
mean     90.443112  1601.082972     2.693601     2.673536
std      58.393801   559.634038     1.446061     0.936818
min      22.000000   680.000000     1.000000     1.000000
25%      52.000000  1200.000000     2.000000     2.000000
50%      78.400000  1515.000000     2.000000     3.000000
75%     107.000000  1780.500000     3.000000     3.000000
max     415.000000  4829.000000    27.000000     6.000000

In [33]:
def bhk_outlier_remover(df):
    exclude_indices = np.array([])
    for location, loc_df in df.groupby('location'):
        bhk_stats = {}
        for bhk, bhk_df in loc_df.groupby('bhk'):
            bhk_stats[bhk] = {
                'mean': np.mean(bhk_df.price),
                'std': np.std(bhk_df.price),
                'count': bhk_df.shape[0]
            }
        for bhk, bhk_df in loc_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices, bhk_df[bhk_df.price<(stats['mean'])].index.values)
    return df.drop(exclude_indices,axis='index')

In [34]:
data = bhk_outlier_remover(data)

In [35]:
data.shape

(1227, 6)

In [36]:
data

      price  sqft          location  bathrooms  bhk            area_type
0      28.0  1400          Adibatla        2.0    4          Carpet Area
1      28.0  1400          Adibatla        2.0    3  Super built-up Area
2      22.0  1050          Adibatla        2.0    2  Super built-up Area
3      28.0  1200          Adibatla        2.0    3          Carpet Area
4      22.0  1000          Adibatla        2.0    3  Super built-up Area
...     ...   ...               ...        ...  ...                  ...
1839  150.0  1970  West Marredpally        2.0    3  Super built-up Area
1840  125.0  1650  West Marredpally        2.0    4  Super built-up Area
1841   80.0  1700  West Marredpally        4.0    2            Plot Area
1842   85.0  1822  West Marredpally        2.0    2  Super built-up Area
1843  140.0  2115  West Marredpally        2.0    3  Super built-up Area

[1227 rows x 6 columns]

# Cleaned Data

In [37]:
data.drop(columns=['area_type'],inplace=True)
data.head()

   price  sqft  location  bathrooms  bhk
0   28.0  1400  Adibatla        2.0    4
1   28.0  1400  Adibatla        2.0    3
2   22.0  1050  Adibatla        2.0    2
3   28.0  1200  Adibatla        2.0    3
4   22.0  1000  Adibatla        2.0    3

In [38]:
data.to_csv("Hyderabad_Cleaned_data.csv")

In [39]:
X = data.drop(columns=['price'])
y = data['price']

In [40]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression,Lasso,Ridge
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [41]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2, random_state=0)

In [42]:
print(X_train.shape)
print(X_test.shape)

(981, 4)
(246, 4)

# Applying Linear Regression

In [43]:
column_trans = make_column_transformer((OneHotEncoder(sparse=False), ['location']),remainder='passthrough')

In [44]:
scaler = StandardScaler()

In [45]:
lr = LinearRegression(normalize=True)

In [46]:
pipe = make_pipeline(column_trans,scaler,lr)

In [47]:
pipe.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression(normalize=True))])

In [48]:
y_pred_lr = pipe.predict(X_test)

In [49]:
r2_score(y_test, y_pred_lr)

0.9132522242501371

# Applying Lasso

In [50]:
lasso = Lasso()

In [51]:
pipe = make_pipeline(column_trans, scaler, lasso)

In [52]:
pipe.fit(X_train, y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('lasso', Lasso())])

In [53]:
y_pred_lasso = pipe.predict(X_test)

In [54]:
r2_score(y_test, y_pred_lasso)

0.896397654160015

# Applying Ridge

In [55]:
ridge = Ridge()

In [56]:
pipe = make_pipeline(column_trans, scaler, ridge)

In [57]:
pipe.fit(X_train, y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('ridge', Ridge())])

In [58]:
y_pred_ridge = pipe.predict(X_test)

In [59]:
r2_score(y_test, y_pred_ridge)

0.9131881863650086

In [60]:
print("Linear Regression: ", r2_score(y_test, y_pred_lr))
print("Lasso: ", r2_score(y_test, y_pred_lasso))
print("Ridge: ", r2_score(y_test, y_pred_ridge))

Linear Regression:  0.9132522242501371
Lasso:  0.896397654160015
Ridge:  0.9131881863650086

In [61]:
import pickle

In [63]:
pickle.dump(pipe, open('HyderabadRidgeModel.pkl', 'wb'))